[
    {
        "Id": 1,
        "Description": "Try raising your Layer Level. Not only does it increase your stat values, but there are level bonuses when reaching certain levels which improve stats even more than before."
    },
    {
        "Id": 2,
        "Description": "Try out Dispatch Missions. Either wait for the time to elapse or use a Return Request Form to improve your character's stats."
    },
    {
        "Id": 3,
        "Description": "When victory seems impossible, try a quest with a lower difficulty level. It might be far easier than the one you're currently stuck on."
    },
    {
        "Id": 4,
        "Description": "Your stats might rise after clearing certain quests. The most effective way of clearing quests is to use idle battling."
    },
    {
        "Id": 5,
        "Description": "You can increase your stats with weapons and equipment. By using material that strengthen your equipment you can further improve their stats."
    },
    {
        "Id": 6,
        "Description": "You can get stat bonuses by increasing the Memory Rank. You can obtain items from clearing quests with a raised Memory Rank."
    },
    {
        "Id": 7,
        "Description": "By using specific Gears on the Layer, the Layer's Gear Level increases. This not only improves stat values but also results in Gear Bonuses."
    },
    {
        "Id": 8,
        "Description": "Try raising your Layer Level. Not only does it increase your stat values, but there are level bonuses when reaching certain levels which improve stats even more than before."
    },
    {
        "Id": 9,
        "Description": "Try out Dispatch Missions. Either wait for the time to elapse or use a Return Request Form to improve your character's stats."
    },
    {
        "Id": 10,
        "Description": "When victory seems impossible, try a quest with a lower difficulty level. It might be far easier than the one you're currently stuck on."
    },
    {
        "Id": 11,
        "Description": "When victory seems impossible, try lowering the difficulty one level and using idle battle. You can tweak character growth and item drops."
    },
    {
        "Id": 12,
        "Description": "Make sure you improve your equipment. A powerful SSS set of equipment drops at the final quest of a specific stage."
    },
    {
        "Id": 13,
        "Description": "Your stats might rise after clearing certain quests. The most effective way of clearing quests is to use idle battling."
    },
    {
        "Id": 14,
        "Description": "本クエストは何度も挑戦が可能です。\r\nバトル中の『?』を選択することで、\r\n効果の確認が可能です。"
    }
]