[
  {
    "OriginMSkillId": 104030034,
    "ConditionDescription": "On the same turn Storm Spear is selected, select 2 or more skills that are a piercing attack that hits all enemies with someone other than this character.",
    "ActivateMSkillId": 8000001
  },
  {
    "OriginMSkillId": 108080012,
    "ConditionDescription": "On the same turn Noir is selected, select 2 or more skills that are an attack that hits all enemies with someone other than this character.",
    "ActivateMSkillId": 8000002
  },
  {
    "OriginMSkillId": 103020027,
    "ConditionDescription": "On the same turn Furious Slash is selected, select 2 or more skills that are a a cutting attack with someone other than this character.",
    "ActivateMSkillId": 8000003
  },
  {
    "OriginMSkillId": 106020048,
    "ConditionDescription": "On the same turn Empty Thrust is selected, select 2 or more skills that hit a single enemy with Layers that use artifacts with someone other than this character.",
    "ActivateMSkillId": 8000004
  },
  {
    "OriginMSkillId": 106020009,
    "ConditionDescription": "On the same turn Moonlight Slice is selected, select 2 or more skills of Layers that use artifacts with someone other than this character.",
    "ActivateMSkillId": 8000005
  },
  {
    "OriginMSkillId": 101010031,
    "ConditionDescription": "On the same turn Resiliance Beat is selected, select 2 or more Layers that use Moonsault with someone other than this character.",
    "ActivateMSkillId": 8000006
  },
  {
    "OriginMSkillId": 109030024,
    "ConditionDescription": "On the same turn Black Band is selected, select 1 or more skills that are a piercing attack that hits a single enemy with someone other than this character.",
    "ActivateMSkillId": 8000007
  },
  {
    "OriginMSkillId": 107030031,
    "ConditionDescription": "On the same turn Jet Arrow is selected, select 2 or more skills that hit a single enemy with Layers that use bows with someone other than this character.",
    "ActivateMSkillId": 8000008
  },
  {
    "OriginMSkillId": 106020051,
    "ConditionDescription": "On the same turn The Ever-Spreading Black Flames is selected, select 2 or more skills that are single-enemy attacks of Layers that use artifacts with someone other than this character.",
    "ActivateMSkillId": 8000009
  },
  {
    "OriginMSkillId": 104030038,
    "ConditionDescription": "On the same turn A Flash of Protection is selected, select 2 or more skills that are a piercing attack that hits a single enemy with someone other than this character.",
    "ActivateMSkillId": 8000010
  },
  {
    "OriginMSkillId": 103020030,
    "ConditionDescription": "On the same turn Bomber Rush is selected, select 2 or more skills that are a cutting attack with someone other than this character.",
    "ActivateMSkillId": 8000011
  },
  {
    "OriginMSkillId": 105010033,
    "ConditionDescription": "On the same turn Fissure Snap is selected, select 2 or more skills that are a blow attack of Layers that use whips with someone other than this character.",
    "ActivateMSkillId": 8000012
  },
  {
    "OriginMSkillId": 103020034,
    "ConditionDescription": "On the same turn Dual Axe is selected, select 2 or more skills from Layers that use axes with someone other than this character.",
    "ActivateMSkillId": 8000013
  },
  {
    "OriginMSkillId": 101010038,
    "ConditionDescription": "On the same turn Cleaer Stream Fist is selected, select 2 or more skills that are a blow-type attack with someone other than this character.",
    "ActivateMSkillId": 8000014
  },
  {
    "OriginMSkillId": 106020055,
    "ConditionDescription": "On the same turn Hekse Dean is selected, select 2 or more skills that are a cutting attack that hits a single enemy with someone other than this character.",
    "ActivateMSkillId": 8000015
  },
  {
    "OriginMSkillId": 107030036,
    "ConditionDescription": "On the same turn that Flying Wind Bow is selected or during a battle where Link Skills have been used 3 times or less, select 2 or more skills that use a piercing attack with someone other than this character.",
    "ActivateMSkillId": 8000016
  },
  {
    "OriginMSkillId": 108080016,
    "ConditionDescription": "On the same turn Black Tempest is selected, select 2 or more skills that are wind or dark type and hit all enemies with someone other than this character.",
    "ActivateMSkillId": 8000017
  },
  {
    "OriginMSkillId": 102020050,
    "ConditionDescription": "On the same turn Crimson Break is selected, select 2 or more skills that are either cut or fire type with someone other than this character.",
    "ActivateMSkillId": 8000018
  },
  {
    "OriginMSkillId": 104030043,
    "ConditionDescription": "On the same turn Splashing Spear is selected, select 2 or more skills that are either piercing or water type with someone other than this character.",
    "ActivateMSkillId": 8000019
  },
  {
    "OriginMSkillId": 109030044,
    "ConditionDescription": "On the same turn Dark Round is selected, select 3 or more skills that belong to anyone with someone other than this character.",
    "ActivateMSkillId": 8000020
  },
  {
    "OriginMSkillId": 103020037,
    "ConditionDescription": "On the same turn that Repeated Blows is selected, act first out of all the axe-wielding characters.",
    "ActivateMSkillId": 8000021
  },
  {
    "OriginMSkillId": 109030047,
    "ConditionDescription": "On the same turn Noir Musket is selected, select 2 or more skills that are either piercing or magical attacks with someone other than this character.",
    "ActivateMSkillId": 8000022
  },
  {
    "OriginMSkillId": 105010035,
    "ConditionDescription": "On the same turn Aqua Snap is selected, select 1 or more skills that are either blow or water type attacks with someone other than this character.",
    "ActivateMSkillId": 8000023
  },
  {
    "OriginMSkillId": 101010042,
    "ConditionDescription": "On the same turn Black Hand is selected, select 2 or more gauntlet skills of anyone than this character.",
    "ActivateMSkillId": 8000024
  },
  {
    "OriginMSkillId": 104030045,
    "ConditionDescription": "On the same turn Spin Lance is selected, select 3 or more skills that are piercing, single enemy attacks or stronger than A-grade skills (*Does not include Total Strength Rating attacks) with someone other than this character.",
    "ActivateMSkillId": 8000025
  },
  {
    "OriginMSkillId": 107030042,
    "ConditionDescription": "On the same turn Anemo Pierce is selected, select 2 or more skills that are either piercing, single enemy attacks or wind type attacks with someone other than this character.",
    "ActivateMSkillId": 8000026
  },
  {
    "OriginMSkillId": 108060021,
    "ConditionDescription": "On the same turn Calm Wind is selected, select 2 or more skills that are wind type skills or D-strength or lower (Does not include Total Strength Rating attacks) with someone other than this character.",
    "ActivateMSkillId": 8000027
  },
  {
    "OriginMSkillId": 105010039,
    "ConditionDescription": "On the same turn Caney Snap is selected, select 2 or more skills that are blow-type, random or light type attacks with someone other than this character.",
    "ActivateMSkillId": 8000028
  },
  {
    "OriginMSkillId": 109030049,
    "ConditionDescription": "On the same turn Hollow End is selected, select 2 or more skills that are either dark or fire type attacks with someone other than this character.",
    "ActivateMSkillId": 8000029
  },
  {
    "OriginMSkillId": 103020042,
    "ConditionDescription": "On the same turn Fierce Moonlit Chariot is selected, select 1 or more skills that are single-enemy attacks with a strength of SS or higher with someone other than this character.",
    "ActivateMSkillId": 8000030
  },
  {
    "OriginMSkillId": 108080018,
    "ConditionDescription": "On the same turn Dark Dominate is selected, select 3 or more skills that are either single-enemy attacks with a dark type or strength A or higher with someone other than this character.",
    "ActivateMSkillId": 8000031
  },
  {
    "OriginMSkillId": 102020052,
    "ConditionDescription": "On the same turn Blood-Red Sword is selected, select 2 or more skills that hit all enemies, are cut type or fire type with someone other than this character.",
    "ActivateMSkillId": 8000032
  },
  {
    "OriginMSkillId": 102020055,
    "ConditionDescription": "On the same turn Sword of Protection is selected, select 2 or more skills that are either a cutting, single type attack or a single-enemy physical attack with someone other than this character.",
    "ActivateMSkillId": 8000033
  },
  {
    "OriginMSkillId": 108070011,
    "ConditionDescription": "On the same turn Rookspiral is selected, select 2 or more skills that are either light type or a magical attack that hits all enemies with someone other than this character.",
    "ActivateMSkillId": 8000034
  },
  {
    "OriginMSkillId": 107030043,
    "ConditionDescription": "On the same turn Devilish Arrow is selected, select 2 or more skills that are a piercing attack with someone other than this character.",
    "ActivateMSkillId": 8000035
  },
  {
    "OriginMSkillId": 108050017,
    "ConditionDescription": "On the same turn Ice Shower is selected, select 2 or more skills that are water type or an attack that hits all enemies with someone other than this character.",
    "ActivateMSkillId": 8000036
  },
  {
    "OriginMSkillId": 101010044,
    "ConditionDescription": "On the same turn Cool Breeze Cannon is selected, select 2 or more skills that are single-enemy blow attacks or have a strength of D or lower (Does not include Total Strength Rating attacks) with someone other than this character.",
    "ActivateMSkillId": 8000037
  },
  {
    "OriginMSkillId": 103020044,
    "ConditionDescription": "On the same turn Ignis Axe is selected, select 2 or more skills that are cut type attacks that hit all enemies or single-enemy fire type attack with someone other than this character.",
    "ActivateMSkillId": 8000038
  },
  {
    "OriginMSkillId": 106020060,
    "ConditionDescription": "On the same turn Noble Dean is selected, select 2 or more skills that are either single-enemy cut attacks or light attacks that hit all enemies with someone other than this character.",
    "ActivateMSkillId": 8000039
  },
  {
    "OriginMSkillId": 106020059,
    "ConditionDescription": "On the same turn The Four-Directional Sword is selected, select 2 or more skills that are cut-type or magical that hit all enemies with someone other than this character.",
    "ActivateMSkillId": 8000040
  },
  {
    "OriginMSkillId": 108070017,
    "ConditionDescription": "On the same turn Lightplosion is selected, select 2 or more skills that are either light type attacks that hit either one or all enemies with someone other than this character.",
    "ActivateMSkillId": 8000041
  },
  {
    "OriginMSkillId": 103020046,
    "ConditionDescription": "On the same turn Tearing Slice is selected, select 2 or more skills that have a strength of SS or more (Does not include Total Strength Rating attacks) with someone other than this character.",
    "ActivateMSkillId": 8000042
  },
  {
    "OriginMSkillId": 102020035,
    "ConditionDescription": "On the same turn Illusion Dance is selected, select 2 or more skills that are cut-type and hit all enemies with someone other than this character.",
    "ActivateMSkillId": 8000043
  },
  {
    "OriginMSkillId": 101010052,
    "ConditionDescription": "On the same turn Tonfa Straight is selected, select 2 or more skills of Layers other than this character that use gauntlets.",
    "ActivateMSkillId": 8000044
  },
  {
    "OriginMSkillId": 101010054,
    "ConditionDescription": "On the same turn 717th Bursting Ball of Light is selected, select 2 or more skills of Layers other than this character that use gauntlets.",
    "ActivateMSkillId": 8000045
  },
  {
    "OriginMSkillId": 101010056,
    "ConditionDescription": "On the same turn Never Punch is selected, select 2 or more skills of Layers other than this character that use gauntlets.",
    "ActivateMSkillId": 8000046
  },
  {
    "OriginMSkillId": 105010042,
    "ConditionDescription": "On the same turn Innocent Structure is selected, select 2 or more skills that have a strength of D or lower (*Does not include Total Strength Rating attacks) with someone other than this character.",
    "ActivateMSkillId": 8000047
  },
  {
    "OriginMSkillId": 101010047,
    "ConditionDescription": "On the same turn Idol Punch is selected, select 2 or more skills that are either single-enemy blow attacks or blow attacks that have a strength of D or lower (*Does not include Total Strength Rating attacks) with someone other than this character.",
    "ActivateMSkillId": 8000048
  },
  {
    "OriginMSkillId": 108060028,
    "ConditionDescription": "On the same turn Va-Breath Dust is selected, select 2 or more skills that are either wind or blow attacks that hit all enemies with someone other than this character.",
    "ActivateMSkillId": 8000051
  },
  {
    "OriginMSkillId": 101010059,
    "ConditionDescription": "On the same turn Avice Blow is selected, select 2 or more skills that are single-enemy blow type attacks with someone other than this character.",
    "ActivateMSkillId": 8000052
  }
]